; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-3 - location
	p1-2 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p3-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s2)
	(at driver5 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at package1 s2)
	(at package2 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s3)
	(link s3 s2)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s4)
	(at driver4 s1)
	(at truck1 s2)
	(at truck2 s3)
	(at truck3 s2)
	(at truck4 s1)
	(at truck5 s3)
	(at package1 s4)
	(at package2 s0)
	))


)

; plan
1. (walk driver4 s2 p1-2)
   deleted: (at driver4 s2)
   added: (at driver4 p1-2)
   goals met: 2 of 10
2. (walk driver4 p1-2 s1)
   deleted: (at driver4 p1-2)
   added: (at driver4 s1)
   goals met: 3 of 10
3. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   goals met: 3 of 10
4. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   goals met: 3 of 10
5. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 3 of 10
6. (drive-truck truck5 s0 s2 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   goals met: 3 of 10
7. (load-truck package1 truck5 s2)
   deleted: (at package1 s2)
   added: (in package1 truck5)
   goals met: 3 of 10
8. (drive-truck truck5 s2 s4 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 3 of 10
9. (unload-truck package1 truck5 s4)
   deleted: (in package1 truck5)
   added: (at package1 s4)
   goals met: 4 of 10
10. (drive-truck truck5 s4 s3 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   goals met: 5 of 10
11. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 10
12. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 6 of 10
13. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 6 of 10
14. (disembark-truck driver2 truck5 s3)
   deleted: (driving driver2 truck5)
   added: (at driver2 s3) (empty truck5)
   goals met: 6 of 10
15. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 6 of 10
16. (drive-truck truck4 s3 s4 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 6 of 10
17. (load-truck package2 truck4 s4)
   deleted: (at package2 s4)
   added: (in package2 truck4)
   goals met: 6 of 10
18. (drive-truck truck4 s4 s0 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 6 of 10
19. (unload-truck package2 truck4 s0)
   deleted: (in package2 truck4)
   added: (at package2 s0)
   goals met: 7 of 10
20. (drive-truck truck4 s0 s1 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 8 of 10
21. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 9 of 10
22. (walk driver3 s2 p2-4)
   deleted: (at driver3 s2)
   added: (at driver3 p2-4)
   goals met: 9 of 10
23. (walk driver3 p2-4 s4)
   deleted: (at driver3 p2-4)
   added: (at driver3 s4)
   goals met: 10 of 10
